app/controllers/charts_controller.rb

  def index
    @charts = Chart.all
---
SELECT "charts".* FROM "charts"

  def create
    @chart = Chart.new(chart_params)

    respond_to do |format|
      if @chart.save
---
INSERT INTO "charts" ("author_name", "content", "created_at", "name", "published_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @chart.destroy
---
DELETE FROM "charts" WHERE "charts"."id" = $1  [["id", 7]]

    def set_chart
      @chart = Chart.find(params[:id])
---
SELECT "charts".* FROM "charts" WHERE "charts"."id" = $1 LIMIT 1  [["id", "7"]]